<img src = "images/logo.PNG" width="200" height="200" align="right">

## Manipulando Banco de Dados SQL Server utilizando Python

<img src = "images/pythonBDs.JPG" width="700" height="700">

In [1]:
# Importando o driver de conexão. Cada SGBD tem o seu próprio driver.
# Caso não esteja instalado, use !pip install pyodbc se quiser instalar via notebook ou no terminal coloque 'pip install pyodbc' 
import pyodbc
import pandas as pd

In [2]:
!pip install pyodbc

Requirement already satisfied: pyodbc in c:\programdata\anaconda3\lib\site-packages (4.0.0-unsupported)

### 1. Conectando ao Banco de Dados

In [ ]:
# Para conectar utilizamos a função connect passando DRIVER, SERVIDOR, NOME DA TABELA.
conexao = pyodbc.connect('Driver={SQL Server};'
                         'Server=server_name;'
                         'Database=database_name;'
                         'Trusted_Connection=yes;')

In [22]:
# Para conectar utilizamos a função connect passando DRIVER, SERVIDOR, NOME DA BASE DE DADOS. Exemplo
conexao = pyodbc.connect('Driver={SQL Server};'
                         'Server=DESKTOP-C9K8P2T\SQLEXPRESS;'
                         'Database=Colegio_Certo;'
                         'Trusted_Connection=yes;')

In [2]:
?pyodbc.connect
# DRIVER={SQL Server};SERVER=localhost;DATABASE=testdb;UID=user;PWD=password

### 2. Operando o Banco de Dados

#### Depois de conectar ao banco de dados, precisamos criar um cursor para efetuarmos qualquer transação como, por exemplo, SELECT, INSERT, DELETE...

In [23]:
# Obtendo o cursor
cursor = conexao.cursor()

In [6]:
# Executando comandos
#cursor.execute("ALGUM COMANDO SQL")

####  Exemplo de SELECT

<img src = "images/query_select.PNG">

In [8]:
cursor.execute("SELECT * FROM Aluno WHERE sexo = 'M'")
for i in cursor:
    print(i)

(1, 'Roger', 30, 'M', 5000.0)
(3, 'Carlos', 56, 'M', 3000.0)

####  Exemplo de SELECT com Pandas

In [ ]:
type(cursor)

In [9]:
query = "SELECT * FROM Aluno a WHERE a.sexo = 'F'"
alunos_sexo_masculino = pd.read_sql_query(query,conexao)

In [11]:
alunos_sexo_masculino

   matricula nome_completo  idade sexo  renda_familiar
0          2           Ana     22    F          2000.0

In [10]:
type(alunos_sexo_masculino)

pandas.core.frame.DataFrame

####  Exemplo de INSERT

<img src = "images/query_insert.PNG">

In [25]:
cursor.execute("INSERT INTO ALUNO VALUES (4,'Luiz Santana',42,'M',18000)")

In [27]:
# Com param style
cursor.execute("INSERT INTO ALUNO  VALUES (?,?,?,?,?)",(5,'Patrícia Sampaio',50,'F',5000))

In [28]:
query = "SELECT * FROM Aluno"
alunos_ = pd.read_sql_query(query,conexao)
alunos_

   matricula     nome_completo  idade sexo  renda_familiar
0          1             Roger     30    M          5000.0
1          2               Ana     22    F          2000.0
2          3            Carlos     56    M          3000.0
3          4      Luiz Santana     42    M         18000.0
4          5  Patrícia Sampaio     50    F          5000.0

####  Exemplo de COMMIT, salvando as alterações...

In [35]:
conexao.commit()

####  Exemplo de UPDATE

<img src = "images/query_update.PNG">

In [30]:
query_atualizacao = "UPDATE ALUNO SET idade = 50 WHERE matricula = 1"
cursor.execute(query_atualizacao)

In [31]:
query = "SELECT * FROM Aluno"
alunos_ = pd.read_sql_query(query,conexao)
alunos_

   matricula     nome_completo  idade sexo  renda_familiar
0          1             Roger     50    M          5000.0
1          2               Ana     22    F          2000.0
2          3            Carlos     56    M          3000.0
3          4      Luiz Santana     42    M         18000.0
4          5  Patrícia Sampaio     50    F          5000.0

####  Exemplo de DELETE

<img src = "images/query_delete.PNG">

In [33]:
query_exclusao = "DELETE FROM Aluno WHERE matricula = 5"
cursor.execute(query_exclusao)

In [34]:
query = "SELECT * FROM Aluno"
alunos_ = pd.read_sql_query(query,conexao)
alunos_

   matricula nome_completo  idade sexo  renda_familiar
0          1         Roger     50    M          5000.0
1          2           Ana     22    F          2000.0
2          3        Carlos     56    M          3000.0
3          4  Luiz Santana     42    M         18000.0

### 3. Fechando as conexões

Depois de utilizar o banco, você deve encerrar a conexão incluindo cursores via Python.

In [36]:
cursor.close()
conexao.close()

Dica: você pode ter um módulo no seu código com as funções para manipular o banco de dados como, por exemplo, abrir_conexao, executar_query e chamá-las todas as vezes que precisar. Considere também tratas as exceções dentro de cada função. É considerado uma boa prática.

<b> Referências: </b> </p> https://wiki.python.org.br/BancosDeDadosSql </p>
https://datatofish.com/how-to-connect-python-to-sql-server-using-pyodbc/ </p>
https://code.google.com/archive/p/pyodbc/wikis/Cursor.wiki </p>
https://pandas.pydata.org/docs/reference/api/pandas.read_sql_query.html </p>
https://www.w3schools.com/sql/default.asp </p>